Revit 2024 API
WallFoundationType.Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
See Also
WallFoundationType Class
WallFoundationType Members
Autodesk.Revit.DB Namespace